<h1>Part1</h1>

In [1]:
import numpy as np
import pandas as pd

In [30]:
from numpy.random import randn
np.random.seed(101)

In [31]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [32]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [33]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [34]:
type(df['W'])

pandas.core.series.Series

In [35]:
type(df)

pandas.core.frame.DataFrame

In [36]:
df[['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [38]:
#Create
df ['W+Y'] = df['W'] + df['Y']

In [39]:
df

          W         X         Y         Z       W+Y
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [44]:
df.drop('W+Y',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [41]:
df

          W         X         Y         Z       W+Y
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [45]:
df.drop('W+Y',axis = 1 ,inplace=True)

In [46]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [47]:
df.drop('W',axis=1)

          X         Y         Z
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965
C  0.740122  0.528813 -0.589001
D -0.758872 -0.933237  0.955057
E  1.978757  2.605967  0.683509

In [56]:
df.shape

(5, 4)

<h1>Part2</h1>

In [57]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [54]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [61]:
df.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [62]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [65]:
df.loc[['A','B','C'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813

In [69]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [70]:
booldf = df[df>0]

In [71]:
booldf

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [73]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [72]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [83]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [86]:
df[df['W']>0]['Z']

A    0.503826
B    0.605965
D    0.955057
E    0.683509
Name: Z, dtype: float64

In [80]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [81]:
df.loc['A']>0

W    True
X    True
Y    True
Z    True
Name: A, dtype: bool

In [98]:
dfseris = df['W']>0
result = df[dfseris]
my_cols = ['W','X']
result[my_cols]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
D  0.188695 -0.758872
E  0.190794  1.978757

In [99]:
result

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [100]:
df[['W','X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [104]:
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [105]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [106]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [107]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [108]:
newid = 'CA NY WY OR CO'.split()

In [109]:
newid

['CA', 'NY', 'WY', 'OR', 'CO']

In [110]:
df['States'] = newid

In [111]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [114]:
df.drop('States',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [118]:
df.set_index('States',inplace=True)

In [119]:
df

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

<h1>Part 3</h1>

In [144]:
#Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index= list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [145]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [146]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [147]:
df

             A         B
G1 1  0.783316 -0.708954
   2  0.586847 -1.621348
   3  0.677535  0.026105
G2 1 -1.678284  0.333973
   2 -0.532471  2.117727
   3  0.197524  2.302987

In [148]:
df.loc['G2']

          A         B
1 -1.678284  0.333973
2 -0.532471  2.117727
3  0.197524  2.302987

In [150]:
df.loc['G2'].loc[1]

A   -1.678284
B    0.333973
Name: 1, dtype: float64

In [153]:
df.index.names= ['Groups','Num']

In [154]:
df

                   A         B
Groups Num
G1     1    0.783316 -0.708954
       2    0.586847 -1.621348
       3    0.677535  0.026105
G2     1   -1.678284  0.333973
       2   -0.532471  2.117727
       3    0.197524  2.302987

<h1>Part4</h1>

In [155]:
outside = ['X1','X1','X1','Y1','Y1','Y1']
inside = [1,2,3,1,2,3]
hier_indx = list(zip(outside,inside))

In [156]:
hier_indx

[('X1', 1), ('X1', 2), ('X1', 3), ('Y1', 1), ('Y1', 2), ('Y1', 3)]

In [157]:
hier_indx = pd.MultiIndex.from_tuples(hier_indx)

In [158]:
hier_indx

MultiIndex([('X1', 1),
            ('X1', 2),
            ('X1', 3),
            ('Y1', 1),
            ('Y1', 2),
            ('Y1', 3)],
           )

In [160]:
df = pd.DataFrame(np.random.randn(6,2),hier_indx,['A','B'])

In [161]:
df

             A         B
X1 1  0.729024 -0.863091
   2  0.305632  0.243178
   3  0.864165 -1.560931
Y1 1 -0.251897 -0.578120
   2  0.236996  0.200780
   3  0.327845  0.674485

In [162]:
df.loc['X1']

          A         B
1  0.729024 -0.863091
2  0.305632  0.243178
3  0.864165 -1.560931

In [165]:
df

             A         B
X1 1  0.729024 -0.863091
   2  0.305632  0.243178
   3  0.864165 -1.560931
Y1 1 -0.251897 -0.578120
   2  0.236996  0.200780
   3  0.327845  0.674485

In [164]:
df.loc['X1'].loc[1]['B']

-0.8630912690663913

In [166]:
df.index.names = ['Groups','Number']

In [167]:
df

                      A         B
Groups Number
X1     1       0.729024 -0.863091
       2       0.305632  0.243178
       3       0.864165 -1.560931
Y1     1      -0.251897 -0.578120
       2       0.236996  0.200780
       3       0.327845  0.674485

In [168]:
df.xs(1,level='Number')

               A         B
Groups
X1      0.729024 -0.863091
Y1     -0.251897 -0.578120